select 读者表.读者编号,
       读者表.姓名,
       借阅表.借阅日期 as 政治经济学借阅日期,
       借阅表.归还日期 as 政治经济学归还日期,
       c.数据库系统概念借阅日期,
       c.数据库系统概念归还日期
from 图书表,
     借阅表,
     读者表,
     (select 读者表.读者编号,
             姓名,
             图书名称,
             借阅日期 as 数据库系统概念借阅日期,
             归还日期 as 数据库系统概念归还日期
      from 图书表,
           借阅表,
           读者表
      where 图书表.图书名称 = '数据库系统概念'
        and 读者表.读者编号 = 借阅表.读者编号
        and 图书表.图书编号 = 借阅表.图书编号) c
where 图书表.图书名称 = '政治经济学'
  and 读者表.读者编号 = c.读者编号
  and 借阅表.读者编号 = c.读者编号
  and 借阅表.图书编号 = 图书表.图书编号